# Перестановка лыжная гонка

# Дана последовательность строк, содержащих ФИО спортсмена и название его команды.
# Необходимо провести жеребьевку - выстроить спортсменов в случайном порядке.
# Существует одно ограничение - 2 спортсмена одной команды не должны идти подряд,
# это уменьшает вероятность их сотрудничества на дистанции и делает гонку более интересной.
# Цитата из правил: В лично-командных соревнованиях, в том числе квалификационных,
# жеребьевка должна быть проведена таким образом, чтобы участники одной
# команды не получили рядом стоящих стартовых номеров.

# Входные данные
# Текстовый файл, содержащий несколько строк, состоящих из ФИО спортсмена и
# названия его команды, разделитель - “,” (запятая)

# Выходные данные
# Текстовый файл, содержащий исходные строки, перемешанные согласно условиям задачи

# Пример
# Вход
# Иванов И.С.,СДЮСШОР2
# Петров А.А.,СДЮСШОР2
# Смирнов К.Т.,Заводоуковск
# Сидоров К.С.,Тобольск
# Выход
# Сидоров К.С.,Тобольск
# Петров А.А.,СДЮСШОР2
# Смирнов К.Т.,Заводоуковск
# Иванов И.С.,СДЮСШОР2