#Задание 1
#Вывести строку "Hello, world!" (без кавычек) в консоль с помощью функции print.

print("Hello, world!")

#Задание 2
#Выведите строку в консоли “Я люблю:”, а затем 3 пронумерованных пункта с тем, что вам нравится, например:

print("Я люблю")
print("1. Встречаться с друзьями")
print("2. Баню")
print("3. Кошку")
